#Использовать asserts

#Использовать "."

МокСоединение = Мок.Получить(Новый HTTPСоединение("http://localhost"));
МокСоединение.ИспользоватьАутентификациюОС = Истина;

Ожидаем.Что(МокСоединение.ИспользоватьАутентификациюОС).Существует();

Результат = МокСоединение.Получить(0, 0);
Ожидаем.Что(Результат).Равно(NULL);

// Примитивные типы
МокСоединение.Когда().Получить(0, 0).ТогдаВозвращает(1);
Результат = МокСоединение.Получить(0, 0);
Ожидаем.Что(Результат).Равно(1);

// Сложные типы

Массив1 = Новый Массив;
Массив1.Добавить(1);

МокСоединение.Когда().Получить(Массив1, 0).ТогдаВозвращает(1);

Массив2 = Новый Массив;
Массив2.Добавить(1);

Результат = МокСоединение.Получить(Массив2, 0);
Ожидаем.Что(Результат).Равно(1);
