#Использовать "../src"
#Использовать 1testrunner
#Использовать fs

Тестер = Новый Тестер;
Тестер.УстановитьФорматЛогФайла(Тестер.ФорматыЛогФайла().GenericExec);

ПутьКТестам = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "tests");
ПутьКОтчетуJUnit = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "out");

ФС.ОбеспечитьПустойКаталог(ПутьКОтчетуJUnit);

КаталогТестов = Новый Файл(ПутьКТестам);

РезультатТестирования = Тестер.ТестироватьКаталог(
	КаталогТестов,
	Новый Файл(ПутьКОтчетуJUnit)
);

Успешно = РезультатТестирования = 0;

Если НЕ Успешно Тогда
	ВызватьИсключение "Тестирование завершилось неудачно!";
КонецЕсли;
