#Использовать asserts

#Использовать ".."


&Тест
Процедура ТестДолжен_ПроверитьАннотациюКласса() Экспорт

	ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures/Классы/ТестовыйОбъект.os"), "ТестовыйКласс");
	МокируемыйОбъект = Новый ТестовыйКласс;

	ИсходныйРефлектор = Новый Рефлектор;
	ИсходнаяТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокируемыйОбъект);
	ИсходнаяТаблицаСвойств = ИсходныйРефлектор.ПолучитьТаблицуСвойств(МокируемыйОбъект);

	МокОбъекта = Мок.Получить(МокируемыйОбъект);
	МокРефлектор = Новый Рефлектор;
	МокТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокОбъекта);
	МокТаблицаСвойств = ИсходныйРефлектор.ПолучитьТаблицуСвойств(МокОбъекта);


	// Почемуто нет там аннотации
	Ожидаем.Что(ИсходнаяТаблицаСвойств.Колонки.Найти("Аннотации")).ЭтоНе().Равно(Неопределено);
	// Ожидаем.Что(ИсходнаяТаблицаСвойств[0].Аннотации[0].Имя).Равно("АннотацияПабликСвойства");
		
	Ожидаем.Что(ИсходнаяТаблицаМетодов[2].Аннотации[0].Имя).Равно("АннотацияПабликПроцедуры");
	Ожидаем.Что(ИсходнаяТаблицаМетодов[2].Аннотации[0].Имя).Равно(МокТаблицаМетодов[2].Аннотации[0].Имя);

	Ожидаем.Что(ИсходнаяТаблицаМетодов[2].Аннотации[1].Имя).Равно("ВтораяАннотацияПабликПроцедуры");
	Ожидаем.Что(МокТаблицаМетодов[2].Аннотации[1].Имя).Равно(ИсходнаяТаблицаМетодов[2].Аннотации[1].Имя);
	
	Ожидаем.Что(ИсходнаяТаблицаМетодов[3].Аннотации[0].Имя).Равно("АннотацияПабликФункции");
	Ожидаем.Что(МокТаблицаМетодов[3].Аннотации[0].Имя).Равно(ИсходнаяТаблицаМетодов[3].Аннотации[0].Имя);

КонецПроцедуры	

&Тест
Процедура ТестДолжен_ПроверитьАннотациюПараметра() Экспорт

	ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures/Классы/ТестовыйОбъект.os"), "ТестовыйКласс");
	МокируемыйОбъект = Новый ТестовыйКласс;

	ИсходныйРефлектор = Новый Рефлектор;
	ИсходнаяТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокируемыйОбъект);

	МокОбъекта = Мок.Получить(МокируемыйОбъект);
	МокРефлектор = Новый Рефлектор;
	МокТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокОбъекта);


	Ожидаем.Что(ЗначениеЗаполнено(ИсходнаяТаблицаМетодов[4].Параметры[0].Аннотации)).Равно(Ложь);
	
	Ожидаем.Что(МокТаблицаМетодов[5].Параметры[0].Аннотации[0].Имя).Равно("Аннотация1ДляПараметра1");
	Ожидаем.Что(ИсходнаяТаблицаМетодов[5].Параметры[0].Аннотации[0].Имя).Равно("Аннотация1ДляПараметра1");
	Ожидаем.Что(ИсходнаяТаблицаМетодов[5].Параметры[0].Аннотации[0].Имя).Равно(МокТаблицаМетодов[5].Параметры[0].Аннотации[0].Имя);

	Ожидаем.Что(ИсходнаяТаблицаМетодов[5].Параметры[0].Аннотации[1].Имя).Равно("Аннотация2ДляПараметра1");
	Ожидаем.Что(ИсходнаяТаблицаМетодов[5].Параметры[0].Аннотации[1].Имя).Равно(МокТаблицаМетодов[5].Параметры[0].Аннотации[1].Имя);
	
	Ожидаем.Что(ИсходнаяТаблицаМетодов[5].Параметры[1].Аннотации[0].Имя).Равно("Аннотация1ДляПараметра2");
	Ожидаем.Что(ИсходнаяТаблицаМетодов[5].Параметры[1].Аннотации[0].Имя).Равно(МокТаблицаМетодов[5].Параметры[1].Аннотации[0].Имя);

	Ожидаем.Что(ИсходнаяТаблицаМетодов[5].Параметры[1].Аннотации[1].Имя).Равно("Аннотация2ДляПараметра2");
	Ожидаем.Что(ИсходнаяТаблицаМетодов[5].Параметры[1].Аннотации[1].Имя).Равно(МокТаблицаМетодов[5].Параметры[1].Аннотации[1].Имя);

	Ожидаем.Что(ЗначениеЗаполнено(МокТаблицаМетодов[5].Параметры[2].Аннотации)).Равно(Ложь);

КонецПроцедуры	

&Тест
Процедура ТестДолжен_ПроверитьПараматрыАннотаций() Экспорт

	ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures/Классы/ТестовыйОбъект.os"), "ТестовыйКласс");
	МокируемыйОбъект = Новый ТестовыйКласс;

	ИсходныйРефлектор = Новый Рефлектор;
	ИсходнаяТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокируемыйОбъект);

	МокОбъекта = Мок.Получить(МокируемыйОбъект);
	МокРефлектор = Новый Рефлектор;
	МокТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокОбъекта);

	Ожидаем.Что(ИсходнаяТаблицаМетодов[7].Аннотации.Колонки.Найти("Параметры")).ЭтоНе().Равно(Неопределено);
	Ожидаем.Что(МокТаблицаМетодов[7].Аннотации[3].Параметры).ЭтоНе().Равно(Неопределено);

	Ожидаем.Что(ИсходнаяТаблицаМетодов[7].Аннотации[3].Параметры).ЭтоНе().Равно(Неопределено);
	Ожидаем.Что(МокТаблицаМетодов[7].Аннотации[3].Параметры).ЭтоНе().Равно(Неопределено);

	Ожидаем.Что(ИсходнаяТаблицаМетодов[7].Аннотации[3].Параметры[0].Имя).Равно("ДажеДважды");
	Ожидаем.Что(ИсходнаяТаблицаМетодов[7].Аннотации[3].Параметры[0].Значение).Равно(Истина);
	Ожидаем.Что(МокТаблицаМетодов[7].Аннотации[3].Параметры[0].Имя).Равно("ДажеДважды");
	Ожидаем.Что(МокТаблицаМетодов[7].Аннотации[3].Параметры[0].Значение).Равно(Истина);

	Ожидаем.Что(МокТаблицаМетодов[7].Аннотации[2].Параметры[0].Имя).Равно("ДажеСПараметром");
	Ожидаем.Что(МокТаблицаМетодов[7].Аннотации[2].Параметры[0].Значение).Равно("Строкой");

	Ожидаем.Что(МокТаблицаМетодов[7].Аннотации[3].Параметры[1].Имя).Равно("Числом");
	Ожидаем.Что(МокТаблицаМетодов[7].Аннотации[3].Параметры[1].Значение).Равно(1);

КонецПроцедуры	