#Использовать asserts

#Использовать ".."


&Тест
Процедура ТестДолжен_ПроверитьАннотациюКласса() Экспорт

	ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures/Классы/ТестовыйОбъект.os"), "ТестовыйКласс");
	МокируемыйОбъект = Новый ТестовыйКласс;

	ИсходныйРефлектор = Новый Рефлектор;
	ИсходнаяТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокируемыйОбъект);
	ИсходнаяТаблицаСвойств = ИсходныйРефлектор.ПолучитьТаблицуСвойств(МокируемыйОбъект);

	МокОбъекта = Мок.Получить(МокируемыйОбъект);
	МокРефлектор = Новый Рефлектор;
	МокТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокОбъекта);
	МокТаблицаСвойств = ИсходныйРефлектор.ПолучитьТаблицуСвойств(МокОбъекта);


	// Почемуто нет там аннотации
	Ожидаем.Что(ИсходнаяТаблицаСвойств.Колонки.Найти("Аннотации")).ЭтоНе().Равно(Неопределено);
	// Ожидаем.Что(ИсходнаяТаблицаСвойств[0].Аннотации[0].Имя).Равно("АннотацияПабликСвойства");
		
	Ожидаем.Что(ИсходнаяТаблицаМетодов[2].Аннотации[0].Имя).Равно("АннотацияПабликПроцедуры");
	Ожидаем.Что(ИсходнаяТаблицаМетодов[2].Аннотации[0].Имя).Равно(МокТаблицаМетодов[2].Аннотации[0].Имя);

	Ожидаем.Что(ИсходнаяТаблицаМетодов[2].Аннотации[1].Имя).Равно("ВтораяАннотацияПабликПроцедуры");
	Ожидаем.Что(МокТаблицаМетодов[2].Аннотации[1].Имя).Равно(ИсходнаяТаблицаМетодов[2].Аннотации[1].Имя);
	
	Ожидаем.Что(ИсходнаяТаблицаМетодов[3].Аннотации[0].Имя).Равно("АннотацияПабликФункции");
	Ожидаем.Что(МокТаблицаМетодов[3].Аннотации[0].Имя).Равно(ИсходнаяТаблицаМетодов[3].Аннотации[0].Имя);

КонецПроцедуры	
