#Использовать asserts

#Использовать ".."


&Тест
Процедура ТестДолжен_ПроверитьАннотациюКласса() Экспорт

	ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures/Классы/ТестовыйОбъект.os"), "ТестовыйКласс");
	МокируемыйОбъект = Новый ТестовыйКласс;

	ИсходныйРефлектор = Новый Рефлектор;
	ИсходнаяТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокируемыйОбъект);
	ИсходнаяТаблицаСвойств = ИсходныйРефлектор.ПолучитьТаблицуСвойств(МокируемыйОбъект);

	МокОбъекта = Мок.Получить(МокируемыйОбъект);
	МокРефлектор = Новый Рефлектор;
	МокТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокОбъекта);
	МокТаблицаСвойств = ИсходныйРефлектор.ПолучитьТаблицуСвойств(МокОбъекта);


	// Почемуто нет там аннотации
	Ожидаем.Что(ИсходнаяТаблицаСвойств.Колонки.Найти("Аннотации")).ЭтоНе().Равно(Неопределено);
	// Ожидаем.Что(ИсходнаяТаблицаСвойств[0].Аннотации[0].Имя).Равно("АннотацияПабликСвойства");
	
	ПроцедураСАннотацией = ИсходнаяТаблицаМетодов.Найти("ПабликПроцедураСАннотацией", "Имя");
	ФункцияСАннотацией = ИсходнаяТаблицаМетодов.Найти("ПабликФункцияСАннотацией", "Имя");
	МокПроцедураСАннотацией = МокТаблицаМетодов.Найти("ПабликПроцедураСАннотацией", "Имя");
	МокФункцияСАннотацией = МокТаблицаМетодов.Найти("ПабликФункцияСАннотацией", "Имя");
	
	Ожидаем.Что(ПроцедураСАннотацией.Аннотации[0].Имя).Равно("АннотацияПабликПроцедуры");
	Ожидаем.Что(ПроцедураСАннотацией.Аннотации[0].Имя).Равно(МокПроцедураСАннотацией.Аннотации[0].Имя);

	Ожидаем.Что(ПроцедураСАннотацией.Аннотации[1].Имя).Равно("ВтораяАннотацияПабликПроцедуры");
	Ожидаем.Что(МокПроцедураСАннотацией.Аннотации[1].Имя).Равно(ПроцедураСАннотацией.Аннотации[1].Имя);
	
	Ожидаем.Что(ФункцияСАннотацией.Аннотации[0].Имя).Равно("АннотацияПабликФункции");
	Ожидаем.Что(МокФункцияСАннотацией.Аннотации[0].Имя).Равно(ФункцияСАннотацией.Аннотации[0].Имя);

КонецПроцедуры	

&Тест
Процедура ТестДолжен_ПроверитьАннотациюПараметра() Экспорт

	ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures/Классы/ТестовыйОбъект.os"), "ТестовыйКласс");
	МокируемыйОбъект = Новый ТестовыйКласс;

	ИсходныйРефлектор = Новый Рефлектор;
	ИсходнаяТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокируемыйОбъект);

	МокОбъекта = Мок.Получить(МокируемыйОбъект);
	МокРефлектор = Новый Рефлектор;
	МокТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокОбъекта);

	ПабликФункцияСАннотациейИПараметром = ИсходнаяТаблицаМетодов.Найти("ПабликФункцияСАннотациейИПараметром", "Имя");
	ПабликФункцияСАннотациейПараметров = ИсходнаяТаблицаМетодов.Найти("ПабликФункцияСАннотациейПараметров", "Имя");
	МокПабликФункцияСАннотациейПараметров = МокТаблицаМетодов.Найти("ПабликФункцияСАннотациейПараметров", "Имя");
	
	Ожидаем.Что(ЗначениеЗаполнено(ПабликФункцияСАннотациейИПараметром.Параметры[0].Аннотации)).Равно(Ложь);
	
	Ожидаем.Что(МокПабликФункцияСАннотациейПараметров.Параметры[0].Аннотации[0].Имя).Равно("Аннотация1ДляПараметра1");
	Ожидаем.Что(ПабликФункцияСАннотациейПараметров.Параметры[0].Аннотации[0].Имя).Равно("Аннотация1ДляПараметра1");
	Ожидаем.Что(ПабликФункцияСАннотациейПараметров.Параметры[0].Аннотации[0].Имя).Равно(МокПабликФункцияСАннотациейПараметров.Параметры[0].Аннотации[0].Имя);

	Ожидаем.Что(ПабликФункцияСАннотациейПараметров.Параметры[0].Аннотации[1].Имя).Равно("Аннотация2ДляПараметра1");
	Ожидаем.Что(ПабликФункцияСАннотациейПараметров.Параметры[0].Аннотации[1].Имя).Равно(МокПабликФункцияСАннотациейПараметров.Параметры[0].Аннотации[1].Имя);
	
	Ожидаем.Что(ПабликФункцияСАннотациейПараметров.Параметры[1].Аннотации[0].Имя).Равно("Аннотация1ДляПараметра2");
	Ожидаем.Что(ПабликФункцияСАннотациейПараметров.Параметры[1].Аннотации[0].Имя).Равно(МокПабликФункцияСАннотациейПараметров.Параметры[1].Аннотации[0].Имя);

	Ожидаем.Что(ПабликФункцияСАннотациейПараметров.Параметры[1].Аннотации[1].Имя).Равно("Аннотация2ДляПараметра2");
	Ожидаем.Что(ПабликФункцияСАннотациейПараметров.Параметры[1].Аннотации[1].Имя).Равно(МокПабликФункцияСАннотациейПараметров.Параметры[1].Аннотации[1].Имя);

	Ожидаем.Что(ЗначениеЗаполнено(МокПабликФункцияСАннотациейПараметров.Параметры[2].Аннотации)).Равно(Ложь);

КонецПроцедуры	

&Тест
Процедура ТестДолжен_ПроверитьПараматрыАннотаций() Экспорт

	ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures/Классы/ТестовыйОбъект.os"), "ТестовыйКласс");
	МокируемыйОбъект = Новый ТестовыйКласс;

	ИсходныйРефлектор = Новый Рефлектор;
	ИсходнаяТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокируемыйОбъект);

	МокОбъекта = Мок.Получить(МокируемыйОбъект);
	МокРефлектор = Новый Рефлектор;
	МокТаблицаМетодов = ИсходныйРефлектор.ПолучитьТаблицуМетодов(МокОбъекта);

	МетодСПараметрами = ИсходнаяТаблицаМетодов.Найти("ТестДолжен_ПроверитьПолучениеАннотацийМетода", "Имя");
	МокМетодСПараметрами = МокТаблицаМетодов.Найти("ТестДолжен_ПроверитьПолучениеАннотацийМетода", "Имя");


	Ожидаем.Что(МетодСПараметрами.Аннотации.Колонки.Найти("Параметры")).ЭтоНе().Равно(Неопределено);
	Ожидаем.Что(МокМетодСПараметрами.Аннотации[3].Параметры).ЭтоНе().Равно(Неопределено);

	Ожидаем.Что(МетодСПараметрами.Аннотации[3].Параметры).ЭтоНе().Равно(Неопределено);
	Ожидаем.Что(МокМетодСПараметрами.Аннотации[3].Параметры).ЭтоНе().Равно(Неопределено);

	Ожидаем.Что(МетодСПараметрами.Аннотации[3].Параметры[0].Имя).Равно("ДажеДважды");
	Ожидаем.Что(МетодСПараметрами.Аннотации[3].Параметры[0].Значение).Равно(Истина);
	Ожидаем.Что(МокМетодСПараметрами.Аннотации[3].Параметры[0].Имя).Равно("ДажеДважды");
	Ожидаем.Что(МокМетодСПараметрами.Аннотации[3].Параметры[0].Значение).Равно(Истина);

	Ожидаем.Что(МокМетодСПараметрами.Аннотации[2].Параметры[0].Имя).Равно("ДажеСПараметром");
	Ожидаем.Что(МокМетодСПараметрами.Аннотации[2].Параметры[0].Значение).Равно("Строкой");

	Ожидаем.Что(МокМетодСПараметрами.Аннотации[3].Параметры[1].Имя).Равно("Числом");
	Ожидаем.Что(МокМетодСПараметрами.Аннотации[3].Параметры[1].Значение).Равно(1);

	МокМетодСАннотированнымиПараметрами = МокТаблицаМетодов.Найти("САннотированнымиПараметрами", "Имя");

	Ожидаем.Что(МокМетодСАннотированнымиПараметрами.Параметры[1].Аннотации[2].Параметры[0].Имя).Равно("СПараметрами");
	Ожидаем.Что(МокМетодСАннотированнымиПараметрами.Параметры[1].Аннотации[2].Параметры[0].Значение).Равно(3);

	Ожидаем.Что(МокМетодСАннотированнымиПараметрами.Параметры[1].Аннотации[2].Параметры[1].Имя).Равно(Неопределено);
	Ожидаем.Что(МокМетодСАннотированнымиПараметрами.Параметры[1].Аннотации[2].Параметры[1].Значение).Равно(4);

	Ожидаем.Что(МокМетодСАннотированнымиПараметрами.Параметры[1].Аннотации[2].Параметры[2].Имя).Равно(Неопределено);
	Ожидаем.Что(МокМетодСАннотированнымиПараметрами.Параметры[1].Аннотации[2].Параметры[2].Значение).Равно(5);

КонецПроцедуры	