#Использовать asserts
#Использовать fluent

#Использовать ".."

&Тест
Процедура ПроверитьРаботуОтвета() Экспорт
	
	Ответ = Новый Ответ(ЭтотОбъект, "ВернутьИнформациюОВызове");
	
	// given
	МокОбъект = Мок.Получить(Тип("Структура"));
	МокОбъект.Когда().Свойство(Матчеры.ЛюбаяСтрока(), Матчеры.ЛюбоеЗначение()).ТогдаОтвечает(Ответ);
	
	// when
	Результат = МокОбъект.Свойство("Поле");
	
	// then
	Ожидаем.Что(Результат).Равно("Вызван метод <Свойство> с параметрами <Поле, >");

КонецПроцедуры

Функция ВернутьИнформациюОВызове(Знач ИнформацияОВызове) Экспорт
		
	МокОбъект = ИнформацияОВызове.Мок();
	ИмяМетода = ИнформацияОВызове.ИмяМетода();
	Параметры = ИнформацияОВызове.Параметры();

	Параметры = ПроцессорыКоллекций.ИзКоллекции(Параметры).ВСтроку(", ");

	Возврат СтрШаблон("Вызван метод <%1> с параметрами <%2>", ИмяМетода, Параметры);

КонецФункции
