#Использовать asserts

#Использовать ".."

&Тест
Процедура ПроверитьРаботуОтвета() Экспорт
	
	Ответ = Новый Ответ(ЭтотОбъект, "ЗадублироватьВызовМетода");
	
	// given
	МокОбъект = Мок.Следить(Тип("Массив"));
	МокОбъект.Когда().Добавить(Матчеры.ЛюбоеЧисло()).ТогдаОтвечает(Ответ);
	
	// when
	МокОбъект.Добавить(1);
	
	// then
	Ожидаем.Что(МокОбъект.Количество()).Равно(2);

КонецПроцедуры

Функция ЗадублироватьВызовМетода(Знач ИнформацияОВызове) Экспорт
	МокОбъект = ИнформацияОВызове.Мок();
	ИмяМетода = ИнформацияОВызове.ИмяМетода();
	Параметры = ИнформацияОВызове.Параметры();

	Рефлектор = Новый Рефлектор();
	Рефлектор.ВызватьМетод(МокОбъект, ИмяМетода, Параметры);
	Рефлектор.ВызватьМетод(МокОбъект, ИмяМетода, Параметры);

КонецФункции
