#Использовать asserts
#Использовать reflector

#Использовать ".."


&Тест
Процедура ТестДолжен_ПроверитьСозданиеМассива() Экспорт

	МокОбъекта = Мок.Получить(Тип("Массив"));
	РасширенныйРефлектор = Новый РефлекторОбъекта(МокОбъекта);
    Ожидаем.Что(РасширенныйРефлектор.ЕстьФункция("_Найти")).Равно(Истина);

КонецПроцедуры	


&Тест
Процедура ТестДолжен_ВызоаРеальногоМетодаШпиона() Экспорт

	МокШпион = Мок.Следить(Тип("Массив"));
	МокШпион.Добавить("Значение");
	МокШпион.Добавить("Значение1");
	Ожидаем.Что(МокШпион.Количество()).Равно(2);

	Ожидаем.Что(МокШпион._Найти("Значение")).Равно(0);
	Ожидаем.Что(МокШпион._Найти("Значение2")).Равно(Неопределено);
	Ожидаем.Что(МокШпион._Найти("Значение1")).Равно(1);
	
КонецПроцедуры	