#Использовать asserts
#Использовать reflector

#Использовать ".."


&Тест
Процедура ТестДолжен_ПроверитьСозданиеМассива() Экспорт

	МокОбъекта = Мок.Получить(Тип("Массив"));
	РасширенныйРефлектор = Новый РефлекторОбъекта(МокОбъекта);
    Ожидаем.Что(РасширенныйРефлектор.ЕстьФункция("_Найти")).Равно(Истина);

КонецПроцедуры	


&Тест
Процедура ТестДолжен_ВызоаРеальногоМетодаШпиона() Экспорт

	МокОбъекта = Мок.Получить(Тип("Массив"));
	РасширенныйРефлектор = Новый РефлекторОбъекта(МокОбъекта);
    Ожидаем.Что(РасширенныйРефлектор.ЕстьФункция("_Найти")).Равно(Истина);

	МокШнион = Мок.Следить(Тип("Массив"));
	МокШнион.Добавить("Значение");
	Ожидаем.Что(МокШнион.Количество()).Равно(1);

	Ожидаем.Что(МокШнион._Найти("Значение")).Равно(0);

КонецПроцедуры	