#Использовать asserts
#Использовать ".."

Перем Объект;

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ПроверитьВызовМетода");
	
	Возврат ВсеТесты;

КонецФункции



Процедура ТестДолжен_ПроверитьВызовМетода() Экспорт

	МокОбъект = Мок.Получить(Тип("Структура"));
	 
	МокОбъект.Когда().Свойство(1).ТогдаВыбрасываетИсключение("Текстовое описание исключения");
	МокОбъект.Когда().Свойство("_ВтороеПлохоеИмя").ТогдаВыбрасываетИсключение(Новый ИнформацияОбОшибке("Краткое Описание", Новый Структура));
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(1);
	Ожидаем.Что(МокОбъект).Метод("Свойство" , МассивПараметров).ВыбрасываетИсключение("Текстовое описание исключения");

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("_ВтороеПлохоеИмя");
	Ожидаем.Что(МокОбъект).Метод("Свойство" , МассивПараметров).ВыбрасываетИсключение("Краткое Описание");

КонецПроцедуры	