#Использовать asserts
#Использовать notify
#Использовать delegate
#Использовать ".."

Функция Сравнить(Знач Параметр = Неопределено) Экспорт
	Возврат Истина;
КонецФункции

Объект = Мок.Получить(Тип("Структура"));

Объект.Когда().Свойство(Матчеры.ЛюбоеЧисло()).ТогдаВозвращает(Истина);
Ожидаем.Что(Объект.Свойство(0)).Равно(Истина);
Ожидаем.Что(Объект.Свойство(1)).Равно(Истина);
Ожидаем.Что(Объект.Свойство("Строка")).Равно(NULL);

Объект.Когда().Свойство(Матчеры.ЛюбаяСтрока()).ТогдаВозвращает(Истина);
Ожидаем.Что(Объект.Свойство("Строка")).Равно(Истина);

КастомныйМатчер = Новый Делегат(ЭтотОбъект, "Сравнить");
Объект.Когда().Свойство(КастомныйМатчер).ТогдаВозвращает(Истина);

Ожидаем.Что(Объект.Свойство(0)).Равно(Истина);
Ожидаем.Что(Объект.Свойство("Строка")).Равно(Истина);
Ожидаем.Что(Объект.Свойство(Неопределено)).Равно(Истина);
Ожидаем.Что(Объект.Свойство(Ложь)).Равно(Истина);
