Перем ЛокальноеСвойство;
Перем ПабликСвойство Экспорт;

&АннотацияПабликСвойства
Перем ПабликСвойствоСАннотацией Экспорт;

&АннотацияЛокальногоСвойства
Перем ЛокальноеСвойствоСАннотацией;


Процедура ПабликПроцедура() Экспорт

КонецПроцедуры


Функция ПабликФункция() Экспорт
	
КонецФункции	


Процедура ЛокальнаяПроцедура()

КонецПроцедуры	


Функция ЛокальнаяФункция()

КонецФункции	


&АннотацияПабликПроцедуры
&ВтораяАннотацияПабликПроцедуры
Процедура ПабликПроцедураСАннотацией() Экспорт

КонецПроцедуры


&АннотацияПабликФункции
Функция ПабликФункцияСАннотацией() Экспорт
	
КонецФункции	

&АннотацияПабликФункции
Функция ПабликФункцияСАннотациейИПараметром(Параметр1) Экспорт
	
КонецФункции

&АннотацияПабликФункции
Функция ПабликФункцияСАннотациейПараметров(
	                                       &Аннотация1ДляПараметра1
                                           &Аннотация2ДляПараметра1
	                                       Параметр1,

	                                       &Аннотация1ДляПараметра2
	                                       &Аннотация2ДляПараметра2
										   Параметр2,
										   Параметр3
										   ) Экспорт
	
КонецФункции	