Перем ЛокальноеСвойство;
Перем ПабликСвойство Экспорт;

&АннотацияПабликСвойства
Перем ПабликСвойствоСАннотацией Экспорт;

&АннотацияЛокальногоСвойства
Перем ЛокальноеСвойствоСАннотацией;


Процедура ПабликПроцедура() Экспорт

КонецПроцедуры


Функция ПабликФункция() Экспорт
	
КонецФункции	


Процедура ЛокальнаяПроцедура()

КонецПроцедуры	


Функция ЛокальнаяФункция()

КонецФункции	


&АннотацияПабликПроцедуры
&ВтораяАннотацияПабликПроцедуры
Процедура ПабликПроцедураСАннотацией() Экспорт

КонецПроцедуры


&АннотацияПабликФункции
Функция ПабликФункцияСАннотацией() Экспорт
	
КонецФункции	
