Перем ЛокальноеСвойство;
Перем ПабликСвойство Экспорт;

&АннотацияПабликСвойства
Перем ПабликСвойствоСАннотацией Экспорт;

&АннотацияЛокальногоСвойства
Перем ЛокальноеСвойствоСАннотацией;


Процедура ПабликПроцедура() Экспорт

КонецПроцедуры


Функция ПабликФункция() Экспорт
	
КонецФункции	


Процедура ЛокальнаяПроцедура()

КонецПроцедуры	


Функция ЛокальнаяФункция()

КонецФункции	


&АннотацияПабликПроцедуры
&ВтораяАннотацияПабликПроцедуры
Процедура ПабликПроцедураСАннотацией() Экспорт

КонецПроцедуры


&АннотацияПабликФункции
Функция ПабликФункцияСАннотацией() Экспорт
	
КонецФункции	

&АннотацияПабликФункции
Функция ПабликФункцияСАннотациейИПараметром(Параметр1) Экспорт
	
КонецФункции

&АннотацияПабликФункции
Функция ПабликФункцияСАннотациейПараметров(
	                                       &Аннотация1ДляПараметра1
                                           &Аннотация2ДляПараметра1
	                                       Параметр1,

	                                       &Аннотация1ДляПараметра2
	                                       &Аннотация2ДляПараметра2
										   Параметр2,
										   Параметр3
										   ) Экспорт
	
КонецФункции	

Процедура САннотированнымиПараметрами(

	&АннотацияДляПараметра
	Знач Парам1,

  &АннотацияДляПараметра
  &АннотацияДляПараметра1
  &АннотацияДляПараметра2(СПараметрами = 3, 4, 5)
  Знач Парам2,

  Парам3,
  Парам4 = Неопределено
) Экспорт


КонецПроцедуры


&НаСервере
&НаКлиентеНаСервереБезКонтекста
&НаЧемУгодно(ДажеСПараметром = "Строкой", СПараметромБезЗначения, "Значение без параметра")
&НаЧемУгодно(ДажеДважды = Истина, Числом = 1)
// Тут не знаю как быть... В значении рефлектора неопределено, но смысл то меняется
&ИПростоТак(Неопределенным = Неопределено)
Процедура ТестДолжен_ПроверитьПолучениеАннотацийМетода() Экспорт

КонецПроцедуры